<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#과제1-1012" data-toc-modified-id="과제1-1012-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>과제1 1012</a></span></li></ul></div>

In [ ]:
아라클 키기 싫어여 무거워여
지금도 메모리 70퍼씩 쓰는뎅 ㅠㅠ
흐어어어엉
엉어엉엉엉
으어어어어엉
엉엉어엉

In [1]:
# !pip install cx_oracle

Collecting cx_oracle
  Downloading cx_Oracle-8.3.0-cp38-cp38-win_amd64.whl (219 kB)
Installing collected packages: cx-oracle
Successfully installed cx-oracle-8.3.0

In [3]:
import cx_Oracle
import pandas as pd

db = cx_Oracle.connect("c##madang", "madang", "localhost:1521/xe") #아이디 비번 호스트이름:포트/서비스이름
cursor = db.cursor()
cursor.execute("select * from BOOK")
x = cursor.fetchall()
df = pd.DataFrame(x)
df.head()

   0        1      2      3
0  1   축구의 역사   굿스포츠   7000
1  2  축구아는 여자    나무수  13000
2  3   축구의 이해  대한미디어  22000
3  4   골프 바이블  대한미디어  35000
4  5    피겨 교본   굿스포츠   8000

In [7]:
db = cx_Oracle.connect("c##madang", "madang", "localhost:1521/xe")
cursor = db.cursor()
cursor.execute("select * from BOOK")
x = cursor.fetchall()
df = pd.DataFrame(x)
cursor.execute("""select column_name from user_tab_columns where table_name = 'BOOK'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

   BOOKID BOOKNAME PUBLISHER  PRICE
0       1   축구의 역사      굿스포츠   7000
1       2  축구아는 여자       나무수  13000
2       3   축구의 이해     대한미디어  22000
3       4   골프 바이블     대한미디어  35000
4       5    피겨 교본      굿스포츠   8000

In [8]:
col_new = [j for i in col for j in i]
col_new

['BOOKID', 'BOOKNAME', 'PUBLISHER', 'PRICE']

In [9]:
col_new = []
for i in col:
    for j in i:
        col_new.append(j)
col_new

['BOOKID', 'BOOKNAME', 'PUBLISHER', 'PRICE']

In [10]:
cursor.close()
db.close()

Q. hr 사용자를 적용해서 원하는 테이블 가져와서 df로 출력

In [ ]:
cursor.execute("""select column_name from user_tab_columns where table_name = 'BOOK'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

In [14]:
# 사용자 연동
db = cx_Oracle.connect("c##hr", "hr", "localhost:1521/xe")
cursor = db.cursor()
# 테이블 불러오기
cursor.execute("select * from EMPLOYEES")
x = cursor.fetchall()
df = pd.DataFrame(x)
# 컬럼명 가져오기
cursor.execute("""select column_name from user_tab_columns where table_name = 'EMPLOYEES'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]   # col = [('JOB_ID',), ('JOB_TITLE',), ('MIN_SALARY',), ('MAX_SALARY',)] 이런 형태임 그래서 2중포문 돌려서 꺼내줌
df.columns = col_new
df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000.0,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000.0,NaN,103.0,60.0

In [16]:
cursor.close()
db.close()

In [18]:
# create
db = cx_Oracle.connect("c##madang", "madang", "localhost:1521/xe")
cs = db.cursor()
sql = "create table sample2(id number)"
cs.execute(sql)
cs.execute("insert into sample2(id) values(1)")
cs.close()
db.commit()
db.close()

In [28]:
db = cx_Oracle.connect("c##cakd7", "cakd7", "localhost:1521/xe")
cursor = db.cursor()
cursor.execute("select * from DEMO")
x = cursor.fetchall()
df = pd.DataFrame(x)
cursor.execute("""select column_name from user_tab_columns where table_name = 'DEMO'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

  CUSTNO GENDER    AGE AREA
0  00251      F  60세이상  100
1  00252      F  60세이상  016
2  00253      M  60세이상  100
3  00254      F  60세이상  043
4  00255      F  60세이상  460

In [29]:
df.shape

(19383, 4)

In [30]:
df.AGE.value_counts()

45세~49세    4082
40세~44세    3677
50세~54세    3114
35세~39세    2769
55세~59세    1774
30세~34세    1679
60세이상      1303
25세~29세     685
20세~24세     283
19세이하        17
Name: AGE, dtype: int64

In [31]:
cursor.close()
db.close()

In [34]:
db = cx_Oracle.connect("c##cakd7", "cakd7", "localhost:1521/xe")
cursor = db.cursor()
cursor.execute("select * from PRODCL")
x = cursor.fetchall()
df = pd.DataFrame(x)
cursor.execute("""select column_name from user_tab_columns where table_name = 'PRODCL'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

  ASSO  BCODE MCODE    SCODE   MCL         SCL
0    A      2  0201  A020114  섬유잡화  영플라자(패션내의)
1    A      2  0201  A020115  섬유잡화  영플라자(영트랜디)
2    A      2  0201  A020116  섬유잡화    영플라자(기타)
3    A      2  0202  A020201  액세서리    선글라스(특정)
4    A      2  0202  A020202  액세서리    영플라자(패션)

In [36]:
df.ASSO.value_counts()

B    2624
C     987
A     630
D     145
Name: ASSO, dtype: int64

In [35]:
df.BCODE.unique()

array([ 2,  3,  4,  5,  6,  7,  8,  9,  1, 19, 20, 21, 22, 23, 24, 25, 26,
       28, 29, 30, 31, 32, 33, 34, 27, 10, 11, 12, 13, 14, 15, 16, 17, 18,
       57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85,
       86, 87, 88, 89, 90, 91, 92], dtype=int64)

In [37]:
cursor.close()
db.close()

#### 과제1 1012
PURPRD 테이블을 가져와서 다음사항을 수행하세요
- pivot_table을 이용하여 고객번호별 대분류별 구매금액을 도출
- 고객별 구매관련 의미있는 인사이트를 뽑아낼 수 있는 데이터셋을 출력(2개 이상)

In [38]:
db = cx_Oracle.connect("c##cakd7", "cakd7", "localhost:1521/xe")
cursor = db.cursor()
cursor.execute("select * from PURPRD")
x = cursor.fetchall()
df = pd.DataFrame(x)
cursor.execute("""select column_name from user_tab_columns where table_name = 'PURPRD'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

MemoryError: Unable to allocate 1.28 GiB for an array with shape (6, 28593030) and data type object

In [ ]:
import numpy as np
piv = df.pivot_table(index='고객번호', columns='대분류별', values='구매금액', aggfunc=(sum, np.mean))
piv